In [54]:
%pylab inline
import pandas as pd 
import glob,os

Populating the interactive namespace from numpy and matplotlib

In [55]:
os.chdir("c:/input/bkp")
results = pd.DataFrame([])

In [56]:
for counter, file in enumerate(glob.glob("2014*")) :
    namedf = pd.read_csv(file, skiprows=0, usecols=[0,1,2,3])
    results = results.append(namedf)

    
    results.to_csv ('c:/output/combinedfile_v.csv')

In [58]:
data = pd.read_csv('c:/output/combinedfile_v.csv')

In [59]:
data.head()

   Unnamed: 0         Date/Time      Lat      Lon    Base
0           0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1           1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2           2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3           3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4           4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [60]:
data.tail()

         Unnamed: 0           Date/Time      Lat      Lon    Base
4534322     1028131  9/30/2014 22:57:00  40.7668 -73.9845  B02764
4534323     1028132  9/30/2014 22:57:00  40.6911 -74.1773  B02764
4534324     1028133  9/30/2014 22:58:00  40.8519 -73.9319  B02764
4534325     1028134  9/30/2014 22:58:00  40.7081 -74.0066  B02764
4534326     1028135  9/30/2014 22:58:00  40.7140 -73.9496  B02764